Repository: feiwhang/mayo
Catalog: lib/l10n/app_*.arb
Languages: th

source: Welcome !
th: ยินดีต้อนรับ !

# loginOrRegis
source: Login or register using phone number
th: ลงชื่อเข้าใช้หรือสมัครด้วยเบอร์โทรศัพท์

# logOrRe
source: Login or register
th: ลงชื่อเข้าใช้หรือสมัคร

# toSendPhone
source: To send code to your phone number
th: เพื่อส่งรหัสเข้าเบอร์มือถือของคุณ

source: Send by SMS
th: ส่งผ่านทาง SMS

# errorPhoneNum
source: Wrong phone number format
th: รูปแบบเบอร์โทรศัพท์ไม่ถูกต้อง

source: Phone verification
th: ยืนยันเบอร์โทรศัพท์

# pleasePutCode
source: Please put in 6-digit code sent to:
th: กรุณาใส่รหัส 6 ตัวที่ส่งไปยัง:

source: Send code again
th: ส่งรหัสยืนยันอีกครั้ง

source: Send code again in
th: ส่งรหัสยืนยันอีกครั้งใน

# cont
source: Continue
th: ต่อไป

# errorVerificationCode
source: Wrong verification code
th: รหัสยืนยันไม่ถูกต้อง

source: Register
th: สมัครสมาชิก

# yourNum
source: Your phone number is
th: เบอร์โทรศัพท์ของคุณคือ

# whatDescYou
source: What describes you best?
th: คุณคือใคร?

# t_a
source: Trainer / Admin
th: ผู้ฝึกสอน / ผู้ดูแลระบบ

# s_c
source: Student / Member
th: นักเรียน / สมาชิก

# enterInfo
source: Enter your information
th: โปรดใส่ข้อมูลส่วนตัวของคุณ

source: Step
th: ขั้นตอนที่

source: Name
th: ชื่อ

source: Age
th: อายุ

source: Gender
th: เพศ

source: Confirm
th: ยืนยัน

source: Male
th: ชาย

source: Female
th: หญิง

source: Others
th: อื่นๆ

# sthWentWrong
source: Something went wrong
th: เกิดข้อผิดพลาด

# errorInvalidPhoneNum
source: Invalid phone number, please use differrent number.
th: เบอร์โทรศัพท์ไม่ถูกต้อง, กรุณาใช้หมายเลขอื่น

source: Loading
th: กำลังดำเนินการ

# verifyingPhone
source: Verifying phone number
th: กำลังยืนยันเบอร์โทร

source: Signing in
th: กำลังเข้าสู่ระบบ

source: Agree to terms
th: ยอมรับเงื่อนไข

# byChecking
source: I have read and accept to the term of services
th: ฉันได้อ่านและยอมรับเงื่อนไขทั้งหมด

# errorBlank
source: No field can be left blank.
th: โปรดกรอกข้อมูลให้ครบทุกช่อง

source: Signing up
th: กำลังลงทะเบียน

# loadingUserData
source: Loading user profile
th: กำลังโหลดข้อมูลผู้ใช้

source: Sign out
th: ออกจากระบบ

# lang
source: Language
th: ภาษา

# changeLang
source: Change language
th: เปลี่ยนภาษา

# changingLang
source: Changing language
th: กำลังเปลี่ยนภาษา

source: Home
th: หน้าหลัก

source: Profile
th: โปรไฟล์

source: My Gym
th: ยิมของฉัน

source: Search
th: ค้นหา

# loadingGym
source: Loading gym info
th: กำลังโหลดข้อมูลยิม

# noGym
source: There's no gym information
th: ไม่มีข้อมูลยิมของคุณ

# createGym
source: Create new gym
th: สร้างยิมใหม่

# joinGym
source: Join existing gym
th: เข้าร่วมยิมอื่น

source: Or
th: หรือ

# img
source: Image
th: รูปภาพ

source: Cancel
th: ยกเลิก

source: Done
th: เสร็จสิ้น

# selectOffical
source: Select Offical gyms
th: เลือกจากยิมมาตรฐาน

source: Description
th: คำอธิบาย

source: Address
th: ที่อยู่

# pickLocation
source: Pick gym location
th: เลือกตำแหน่งยิม

# pleaseEnableLocation
source: Please enable location services
th: โปรดเปิดใช้งานระบุตำแหน่ง

source: Refresh
th: ลองใหม่อีกครั้ง
